package ru.asteises.authv2.controller;

// auth-v2
// todo Как могут приходить данные из браузера или приложений? Как правильно их принять в приложение?
// todo Как получить данные из виджета telegram? Как я их могу увидеть?
// todo Как правильно настроить профили?
// todo Как правильно упаковать проект в docker?
// todo Как правильно сделать деплой проекта на сервер?

// NeftLink
// todo После продолжительного времени бездействия, приложение не стартует, не удалось понять почему...
// todo profiles + docker + deploy
// todo Как правильно сделать проверку введенного пароля? Например, мы должны их сравнить, они приходят в зашифрованном виде,
//  или в том, в котором мы запросим у фронта? Сравнение вроде бы как относится к валидации, нужно ли передавать пароли в сервис
//  или добавить класс шифрования в контроллер?
// todo Как вытащить данные текущего пользователя?

// LISA
// todo Не могу настроить проект с telegram ботом... Все перепробовал, должно работать,
//  но нет... То есть по факту проект запускается, но обмена данными не происходит.

public class AuthController {
}
